tests/integration/cassettes/test_number_conversion/test_happy_path_scalar_response_async.yaml

interactions:
- request:
    body: '<?xml version=''1.0'' encoding=''utf-8''?>

      <soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Body><ns0:NumberToWords
      xmlns:ns0="http://www.dataaccess.com/webservicesserver/"><ns0:ubiNum>42</ns0:ubiNum></ns0:NumberToWords></soap-env:Body></soap-env:Envelope>'
    headers:
      accept:
      - '*/*'
      accept-encoding:
      - gzip, deflate
      connection:
      - keep-alive
      content-length:
      - '291'
      content-type:
      - text/xml; charset=utf-8
      host:
      - www.dataaccess.com
      soapaction:
      - '""'
      user-agent:
      - Zeep/4.2.1 (www.python-zeep.org)
    method: POST
    uri: https://www.dataaccess.com/webservicesserver/NumberConversion.wso
  response:
    content: "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n
      \ <soap:Body>\r\n    <m:NumberToWordsResponse xmlns:m=\"http://www.dataaccess.com/webservicesserver/\">\r\n
      \     <m:NumberToWordsResult>forty two </m:NumberToWordsResult>\r\n    </m:NumberToWordsResponse>\r\n
      \ </soap:Body>\r\n</soap:Envelope>"
    headers:
      Cache-Control:
      - private, max-age=0
      Content-Encoding:
      - gzip
      Content-Length:
      - '311'
      Content-Type:
      - text/xml; charset=utf-8
      Date:
      - Fri, 27 Jan 2023 13:14:04 GMT
      Server:
      - Server
      Vary:
      - Accept-Encoding
      Web-Service:
      - DataFlex 19.1
      X-Powered-By:
      - ASP.NET
    http_version: HTTP/1.1
    status_code: 200
version: 1
